In [1]:
import numpy as np
import pandas as pd

In [2]:
detail1 = {'Name': ['Ibrahim Musa', 'Emeka Jude', 'Emmanuel Ayomide', 'Nnamdi Ike'],
           'Age': [24, 25, 27, 24],
           'Course': ['Physics', 'Statistics', 'Mathematics', 'Chemistry'],
           'Sport': ['Football', 'Volleyball', 'Swimming', 'Basketball'],
           'Amount': ['#20000', '#25000', '#20000', '#20200']}

In [3]:
df = pd.DataFrame(detail1)

In [4]:
df

               Name  Age       Course       Sport  Amount
0      Ibrahim Musa   24      Physics    Football  #20000
1        Emeka Jude   25   Statistics  Volleyball  #25000
2  Emmanuel Ayomide   27  Mathematics    Swimming  #20000
3        Nnamdi Ike   24    Chemistry  Basketball  #20200

In [5]:
df['Name'].str.lower()

0        ibrahim musa
1          emeka jude
2    emmanuel ayomide
3          nnamdi ike
Name: Name, dtype: object

In [6]:
df['Name'].str.upper()

0        IBRAHIM MUSA
1          EMEKA JUDE
2    EMMANUEL AYOMIDE
3          NNAMDI IKE
Name: Name, dtype: object

In [7]:
df['Name'].str.islower()

0    False
1    False
2    False
3    False
Name: Name, dtype: bool

In [8]:
df['Name'].str.isupper()

0    False
1    False
2    False
3    False
Name: Name, dtype: bool

In [9]:
df['Name'].str.lower().str.islower()

0    True
1    True
2    True
3    True
Name: Name, dtype: bool

In [10]:
df['Name'].str.swapcase()

0        iBRAHIM mUSA
1          eMEKA jUDE
2    eMMANUEL aYOMIDE
3          nNAMDI iKE
Name: Name, dtype: object

In [11]:
df['Course'].str.len()

0     7
1    10
2    11
3     9
Name: Course, dtype: int64

In [12]:
df['Amount'].str.isnumeric()

0    False
1    False
2    False
3    False
Name: Amount, dtype: bool

### Splitting and Replacing
* cat - Concatenates the series/index elements with given separator.
* Split - Splits each string with the given pattern.
* Replace - Replaces a values with another value.

In [13]:
df['Name'].str.cat(sep='_')

'Ibrahim Musa_Emeka Jude_Emmanuel Ayomide_Nnamdi Ike'

In [14]:
df['Name'].str.cat(sep=', ' )

'Ibrahim Musa, Emeka Jude, Emmanuel Ayomide, Nnamdi Ike'

In [16]:
'We are learning Pandas'.split(' ')

['We', 'are', 'learning', 'Pandas']

In [17]:
df['Name'].str.split(' ')

0        [Ibrahim, Musa]
1          [Emeka, Jude]
2    [Emmanuel, Ayomide]
3          [Nnamdi, Ike]
Name: Name, dtype: object

In [18]:
df['Name'].str.split(' ').str.get(0)

0     Ibrahim
1       Emeka
2    Emmanuel
3      Nnamdi
Name: Name, dtype: object

In [19]:
df['Name'].str.split(' ')[0]

['Ibrahim', 'Musa']

In [20]:
df['Name'].str.split(' ')[0][0]

'Ibrahim'

In [21]:
df[['First Name', 'Last Name']] = df['Name'].str.split(' ', expand=True)

In [22]:
df

               Name  Age       Course       Sport  Amount First Name Last Name
0      Ibrahim Musa   24      Physics    Football  #20000    Ibrahim      Musa
1        Emeka Jude   25   Statistics  Volleyball  #25000      Emeka      Jude
2  Emmanuel Ayomide   27  Mathematics    Swimming  #20000   Emmanuel   Ayomide
3        Nnamdi Ike   24    Chemistry  Basketball  #20200     Nnamdi       Ike

In [23]:
df['Amount'].sum()

'#20000#25000#20000#20200'

In [24]:
df['Amount'].str.replace('#', '')

0    20000
1    25000
2    20000
3    20200
Name: Amount, dtype: object

In [25]:
df['Amount'].str.replace('#', '').astype(float)

0    20000.0
1    25000.0
2    20000.0
3    20200.0
Name: Amount, dtype: float64

In [26]:
df['Amount'].str.replace('#', '').astype(float).sum()

85200.0

### Patterns
* Count - Returns count of appearance of pattern in each element.
* Startswith - Returns True if the element in the series/index starts with the pattern.
* Endswith - Returns True if the element in the series/index ends with the pattern.
* Find - Returns the first position of the first occurrence of the pattern.
* Findall - Returns a list of all occurrence of the pattern.

In [27]:
df['Name'].str.lower().str.count('e')

0    0
1    3
2    3
3    1
Name: Name, dtype: int64

In [28]:
df['Name'].str.lower().str.startswith('e')

0    False
1     True
2     True
3    False
Name: Name, dtype: bool

In [29]:
df['Name'].str.lower().str.endswith('e')

0    False
1     True
2     True
3     True
Name: Name, dtype: bool

In [30]:
df['Name'].str.lower().str.find('m')

0    6
1    1
2    1
3    3
Name: Name, dtype: int64

In [31]:
df['Name'].str.lower().str.findall('m')

0       [m, m]
1          [m]
2    [m, m, m]
3          [m]
Name: Name, dtype: object

## Groupby

In [32]:
df1 = pd.read_csv('Customer.csv')

In [33]:
df1.head()

,Customer ID,Customer Name,Segment,Age,Country,City,State,Postal Code,Region
0,CG-12520,Claire Gute,Consumer,67,United States,Henderson,Kentucky,42420,South
1,DV-13045,Darrin Van Huff,Corporate,31,United States,Los Angeles,California,90036,West
2,SO-20335,Sean O'Donnell,Consumer,65,United States,Fort Lauderdale,Florida,33311,South
3,BH-11710,Brosina Hoffman,Consumer,20,United States,Los Angeles,California,90032,West
4,AA-10480,Andrew Allen,Consumer,50,United States,Concord,North Carolina,28027,South

In [38]:
df1.head(10)

,Customer ID,Customer Name,Segment,Age,Country,City,State,Postal Code,Region
0,CG-12520,Claire Gute,Consumer,67,United States,Henderson,Kentucky,42420,South
1,DV-13045,Darrin Van Huff,Corporate,31,United States,Los Angeles,California,90036,West
2,SO-20335,Sean O'Donnell,Consumer,65,United States,Fort Lauderdale,Florida,33311,South
3,BH-11710,Brosina Hoffman,Consumer,20,United States,Los Angeles,California,90032,West
4,AA-10480,Andrew Allen,Consumer,50,United States,Concord,North Carolina,28027,South
5,IM-15070,Irene Maddox,Consumer,66,United States,Seattle,Washington,98103,West
6,HP-14815,Harold Pawlan,Home Office,20,United States,Fort Worth,Texas,76106,Central
7,PK-19075,Pete Kriz,Consumer,46,United States,Madison,Wisconsin,53711,Central
8,AG-10270,Alejandro Grove,Consumer,18,United States,West Jordan,Utah,84084,West
9,ZD-21925,Zuschuss Donatelli,Consumer,66,United States,San Francisco,California,94109,West

In [40]:
df2 = df1.iloc[0:11] # Working with a smaller dataset.

In [41]:
df2

,Customer ID,Customer Name,Segment,Age,Country,City,State,Postal Code,Region
0,CG-12520,Claire Gute,Consumer,67,United States,Henderson,Kentucky,42420,South
1,DV-13045,Darrin Van Huff,Corporate,31,United States,Los Angeles,California,90036,West
2,SO-20335,Sean O'Donnell,Consumer,65,United States,Fort Lauderdale,Florida,33311,South
3,BH-11710,Brosina Hoffman,Consumer,20,United States,Los Angeles,California,90032,West
4,AA-10480,Andrew Allen,Consumer,50,United States,Concord,North Carolina,28027,South
5,IM-15070,Irene Maddox,Consumer,66,United States,Seattle,Washington,98103,West
6,HP-14815,Harold Pawlan,Home Office,20,United States,Fort Worth,Texas,76106,Central
7,PK-19075,Pete Kriz,Consumer,46,United States,Madison,Wisconsin,53711,Central
8,AG-10270,Alejandro Grove,Consumer,18,United States,West Jordan,Utah,84084,West
9,ZD-21925,Zuschuss Donatelli,Consumer,66,United States,San Francisco,California,94109,West
10,KB-16585,Ken Black,Corporate,67,United States,Fremont,Nebraska,68025,Central

In [42]:
states = df2.groupby('State')

In [43]:
type(states)

pandas.core.groupby.generic.DataFrameGroupBy

In [44]:
states.groups # Different groups and their indexes on the dataframe

{'California': Int64Index([1, 3, 9], dtype='int64'),
 'Florida': Int64Index([2], dtype='int64'),
 'Kentucky': Int64Index([0], dtype='int64'),
 'Nebraska': Int64Index([10], dtype='int64'),
 'North Carolina': Int64Index([4], dtype='int64'),
 'Texas': Int64Index([6], dtype='int64'),
 'Utah': Int64Index([8], dtype='int64'),
 'Washington': Int64Index([5], dtype='int64'),
 'Wisconsin': Int64Index([7], dtype='int64')}

In [45]:
df2.loc[0]

Customer ID           CG-12520
Customer Name      Claire Gute
Segment               Consumer
Age                         67
Country          United States
City                 Henderson
State                 Kentucky
Postal Code              42420
Region                   South
Name: 0, dtype: object

In [46]:
df2['State'].nunique()

9

In [47]:
df2['State'].unique()

array(['Kentucky', 'California', 'Florida', 'North Carolina',
       'Washington', 'Texas', 'Wisconsin', 'Utah', 'Nebraska'],
      dtype=object)

In [48]:
states.size()

State
California        3
Florida           1
Kentucky          1
Nebraska          1
North Carolina    1
Texas             1
Utah              1
Washington        1
Wisconsin         1
dtype: int64

In [49]:
states.get_group('California')

,Customer ID,Customer Name,Segment,Age,Country,City,State,Postal Code,Region
1,DV-13045,Darrin Van Huff,Corporate,31,United States,Los Angeles,California,90036,West
3,BH-11710,Brosina Hoffman,Consumer,20,United States,Los Angeles,California,90032,West
9,ZD-21925,Zuschuss Donatelli,Consumer,66,United States,San Francisco,California,94109,West

In [50]:
states.get_group('Florida')

,Customer ID,Customer Name,Segment,Age,Country,City,State,Postal Code,Region
2,SO-20335,Sean O'Donnell,Consumer,65,United States,Fort Lauderdale,Florida,33311,South

In [52]:
states.get_group('California')['Postal Code'].sum() # you can work with columns in a groupby dataframe

274177

In [53]:
states['Postal Code'].sum()

State
California        274177
Florida            33311
Kentucky           42420
Nebraska           68025
North Carolina     28027
Texas              76106
Utah               84084
Washington         98103
Wisconsin          53711
Name: Postal Code, dtype: int64

In [54]:
states['Postal Code'].mean()

State
California        91392.333333
Florida           33311.000000
Kentucky          42420.000000
Nebraska          68025.000000
North Carolina    28027.000000
Texas             76106.000000
Utah              84084.000000
Washington        98103.000000
Wisconsin         53711.000000
Name: Postal Code, dtype: float64

In [55]:
states['Postal Code'].max()

State
California        94109
Florida           33311
Kentucky          42420
Nebraska          68025
North Carolina    28027
Texas             76106
Utah              84084
Washington        98103
Wisconsin         53711
Name: Postal Code, dtype: int64

In [56]:
states.agg({'Postal Code': 'sum', 'Age': 'mean'})

                Postal Code  Age
State
California           274177   39
Florida               33311   65
Kentucky              42420   67
Nebraska              68025   67
North Carolina        28027   50
Texas                 76106   20
Utah                  84084   18
Washington            98103   66
Wisconsin             53711   46

In [57]:
states.agg({'Postal Code': ['sum', 'max'], 'Age': 'mean'})

               Postal Code         Age
                       sum    max mean
State
California          274177  94109   39
Florida              33311  33311   65
Kentucky             42420  42420   67
Nebraska             68025  68025   67
North Carolina       28027  28027   50
Texas                76106  76106   20
Utah                 84084  84084   18
Washington           98103  98103   66
Wisconsin            53711  53711   46

In [59]:
for name, data in states:
    print(name)
    print(data, end='\n\n')

California
  Customer ID       Customer Name    Segment  Age        Country  \
1    DV-13045     Darrin Van Huff  Corporate   31  United States
3    BH-11710     Brosina Hoffman   Consumer   20  United States
9    ZD-21925  Zuschuss Donatelli   Consumer   66  United States

            City       State  Postal Code Region
1    Los Angeles  California        90036   West
3    Los Angeles  California        90032   West
9  San Francisco  California        94109   West

Florida
  Customer ID   Customer Name   Segment  Age        Country             City  \
2    SO-20335  Sean O'Donnell  Consumer   65  United States  Fort Lauderdale

     State  Postal Code Region
2  Florida        33311  South

Kentucky
  Customer ID Customer Name   Segment  Age        Country       City  \
0    CG-12520   Claire Gute  Consumer   67  United States  Henderson

      State  Postal Code Region
0  Kentucky        42420  South

Nebraska
   Customer ID Customer Name    Segment  Age        Country     City  \
10    KB-16585     Ken Black  Corporate   67  United States  Fremont

       State  Postal Code   Region
10  Nebraska        68025  Central

North Carolina
  Customer ID Customer Name   Segment  Age        Country     City  \
4    AA-10480  Andrew Allen  Consumer   50  United States  Concord

            State  Postal Code Region
4  North Carolina        28027  South

Texas
  Customer ID  Customer Name      Segment  Age        Country        City  \
6    HP-14815  Harold Pawlan  Home Office   20  United States  Fort Worth

   State  Postal Code   Region
6  Texas        76106  Central

Utah
  Customer ID    Customer Name   Segment  Age        Country         City  \
8    AG-10270  Alejandro Grove  Consumer   18  United States  West Jordan

  State  Postal Code Region
8  Utah        84084   West

Washington
  Customer ID Customer Name   Segment  Age        Country     City  \
5    IM-15070  Irene Maddox  Consumer   66  United States  Seattle

        State  Postal Code Region
5  Washington        98103   West

Wisconsin
  Customer ID Customer Name   Segment  Age        Country     City      State  \
7    PK-19075     Pete Kriz  Consumer   46  United States  Madison  Wisconsin

   Postal Code   Region
7        53711  Central